# StairsAttrTreadFrontProfile Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsAttrTreadFrontProfile Property
ParameterTypeId Class See Also
---
"Nosing Profile"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsAttrTreadFrontProfile { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsAttrTreadFrontProfile As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsAttrTreadFrontProfile {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace